In [ ]:
"""
Class More Than 5 Students

There is a table courses with columns: student and class

Please list out all classes which have more than or equal to 5 students.

For example:

+---------+------------+
| student | class      |
+---------+------------+
| A       | Math       |
| B       | English    |
| C       | Math       |
| D       | Biology    |
| E       | Math       |
| F       | Computer   |
| G       | Math       |
| H       | Math       |
| I       | Math       |
+---------+------------+
"""

In [ ]:
"""testcase"""
{"headers": {"courses": ["student", "class"]}, 
 "rows": {"courses": [["A", "Math"], 
                      ["B", "English"], 
                      ["C", "Math"], 
                      ["D", "Biology"], 
                      ["E", "Math"], 
                      ["F", "Computer"], 
                      ["G", "Math"], 
                      ["H", "Math"], 
                      ["I", "Math"]]}}

In [ ]:
"""SQL table creation and data insertion"""
DROP TABLE IF EXISTS courses;

CREATE TABLE courses(
student varchar(50) NOT NULL,
class varchar(50) NOT NULL);

INSERT INTO courses VALUES
("A", "Math"), 
("B", "English"), 
("C", "Math"), 
("D", "Biology"), 
("E", "Math"), 
("F", "Computer"), 
("G", "Math"), 
("H", "Math"), 
("I", "Math");

In [ ]:
"""SQL solution"""
# be careful with duplicates of the same students taking the same courses
# 1
SELECT class
FROM courses
GROUP BY class
HAVING COUNT(DISTINCT student) >= 5

# 2 slower solution
SELECT class
FROM (SELECT DISTINCT * FROM courses) AS c
GROUP BY class
HAVING COUNT(*) >= 5

In [11]:
"""pandas dataframe creation"""
import pandas as pd

c1 = [["A", "Math"], 
["B", "English"], 
["C", "Math"], 
["D", "Biology"], 
["E", "Math"], 
["F", "Computer"], 
["G", "Math"], 
["H", "Math"], 
["I", "Math"]]

c2 = [["A", "Math"], 
["B", "English"], 
["A", "Math"], 
["D", "Biology"], 
["E", "Math"], 
["F", "Computer"], 
["A", "Math"], 
["H", "Math"], 
["I", "Math"]]

courses1 = pd.DataFrame(c1, columns=['student', 'class'])
courses2 = pd.DataFrame(c2, columns=['student', 'class'])
courses1.head()

  student    class
0       A     Math
1       B  English
2       C     Math
3       D  Biology
4       E     Math

In [18]:
df1 = courses1.drop_duplicates().groupby('class')['student'].count().reset_index()
df1

      class  student
0   Biology        1
1  Computer        1
2   English        1
3      Math        6

In [21]:
df1[df1['student'] >= 5]

  class  student
3  Math        6

In [22]:
df2 = courses2.drop_duplicates().groupby('class')['student'].count().reset_index()
df2

      class  student
0   Biology        1
1  Computer        1
2   English        1
3      Math        4

In [24]:
df2[df2['student'] >= 5]

Empty DataFrame
Columns: [class, student]
Index: []